# VertexStreamPositionColored Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexStreamPositionColored Class
Members See Also
---
A stream that can be used to write vertices of type VertexPositionColored into a buffer (see VertexBuffer).
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class VertexStreamPositionColored : VertexStream
```

Visual Basic
---
```text
Public Class VertexStreamPositionColored _
	Inherits VertexStream
```

Visual C++
---
```text
public ref class VertexStreamPositionColored : public VertexStream
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.DirectContext3D..::..VertexStream Autodesk.Revit.DB.DirectContext3D..::..VertexStreamPositionColored
# See Also
VertexStreamPositionColored Members
Autodesk.Revit.DB.DirectContext3D Namespace